10/data/attachments/3cd5f29eafb81d9b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_3366b451-5789-4053-9ce3-aaa5786d2676</nif:username>
            <nif:friendToBeAdded>Kaitlyn_yourself_Friend_89559_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>